# Задайте натуральное число N. Напишите программу, которая составит список простых множителей числа N.
N = int(input("Ввелите натуралное число N  "))
i = 2
list = []
while True:
    if N % i == 0 :
        list.append(i)
        N /= i
        i = 2
    elif N == 1:
        break
    else:
        i += 1

print(f'Простые множители числа: {list}')

